Repository: AndreeMeilio/college-scheduler
Catalog: lib/config/l10n/app_*.arb
Languages: id

# deleteConfirmationTitle
source: Confirmation Deletion!
id: Konfirmasi Penghapusan!

# deleteDescription
source: The deleted data cannot be restored, Are you sure you want to delete it?
id: Data yang terhapus tidak dapat dikembalikan. Apakah Anda yakin ingin menghapusnya?

# deleteCancelButton
source: Cancel
id: Batal

# deleteProceedButton
source: Yes, Delete it
id: Ya, Hapus

# quoteAfterLogin
source: "THE BEST TIME TO GROW A TREE IS 20 YEARS AGO, THE SECOND BEST TIME IS NOW"
id: "WAKTU TERBAIK UNTUK MENANAM POHON ADALAH 20 TAHUN YANG LALU, WAKTU TERBAIK KEDUA ADALAH SEKARANG"

# quoteAfterLoginMark
source: ~ Chinese Proverb
id: ~ Pepatah Cina

# gettingDataSuccess
source: Successfully getting data {feature}
id: Berhasil mendapatkan data {feature}

# creatingDataSuccess
source: Successfully creating data {feature}
id: Berhasil membuat data {feature}

# updatingDataSuccess
source: Successfully updating data {feature}
id: Berhasil mengubah data {feature}

# deletingDataSuccess
source: Successfully deleting data {feature}
id: Berhasil menghapus data {feature}

# gettingDataEmpty
source: You don't have data on {feature}
id: Anda tidak memiliki data {feature}

# gettingDataProblem
source: There's a problem when getting {feature} data
id: Ada masalah saat mendapatkan data {feature}

# creatingDataProblem
source: There's a problem when creating {feature} data
id: Ada masalah saat membuat data {feature}

# updatingDataProblem
source: There's a problem when updating {feature} data
id: Ada masalah saat mengubah data {feature}

# deletingDataProblem
source: There's a problem when deleting {feature} data
id: Ada masalah saat menghapus data {feature}

# homeMenuButton
source: Home
id: Beranda

# eventsMenuButton
source: Events
id: Acara

# settingsMenuButton
source: Settings
id: Pengaturan

# notificationSettingsLabel
source: Notification
id: Pemberitahuan

# accountSettingsLabel
source: Account
id: Akun

# incoming
source: Coming Soon
id: Segera Hadir

# changeFullnameOrUsernameTitle
source: Change Fullname Or Username
id: Ubah Nama Lengkap Atau Nama Pengguna

# fullnameLabel
source: Fullname
id: Nama Lengkap

# fullnameHint
source: Input your Fullname
id: Masukkan Nama Lengkap Anda

# fullnameEmpty
source: Please input your Fullname
id: Silakan masukkan Nama Lengkap Anda

# fullnameNewhint
source: Input your new Fullname
id: Masukkan Nama Lengkap baru Anda

# fullnameNewEmptyError
source: Please input your new Fullname
id: Silakan masukkan Nama Lengkap baru Anda

# usernameLabel
source: Username
id: Nama Pengguna

# usernameEmpty
source: Please input your account username
id: Silakan masukkan nama pengguna akun Anda

# usernameHint
source: Input your Username
id: Masukkan Nama Pengguna Anda

# usernameNewEmptyError
source: Please input your new Username
id: Silakan masukkan Nama Pengguna baru Anda

# passwordLabel
source: Password
id: Kata Sandi

# passwordHint
source: Input your password
id: Masukkan kata sandi Anda

# passwordEmpty
source: Please input your account password
id: Silakan masukkan kata sandi akun Anda

# passwordUpTo8
source: Password Must Up To 8 Characters
id: Kata Sandi Harus Hingga 8 Karakter

# passwordContainNumber
source: Password Must Contain At least One Number
id: Kata Sandi Harus Mengandung Setidaknya Satu Angka

# passwordContainerSymbol
source: Password Must Contain Symbol
id: Kata Sandi Harus Mengandung Simbol

# confirmationPasswordTitle
source: Confirmation Password
id: Konfirmasi Kata Sandi

# confirmationPasswordHint
source: Input Your Confirmation Password
id: Masukkan Kata Sandi Konfirmasi Anda

# confirmationPasswordEmpty
source: Please input your confirmation password
id: Harap masukkan konfirmasi kata sandi

# passwordAndConfirmationDontMatch
source: Your password and confirmation password doesn't match
id: Kata sandi dan kata sandi konfirmasi Anda tidak cocok

source: Register Failed
id: Daftar Gagal

source: Register Account
id: Daftar Akun

source: Register Success
id: Daftar Berhasil

# selectClassLabel
source: Select Class
id: Daftar Kelas

source: Already Have Account?
id: Sudah Punya Akun?

source: Login Here
id: Masuk di sini

# loginEmpty
source: Please input your credentials
id: Silakan masukkan kredensial Anda

# loginLabel
source: Login
id: Masuk

source: Login Success
id: Masuk Berhasil

source: Login Failed
id: Masuk Gagal

# noAccount
source: Don't Have Account?
id: Belum Punya Akun?

source: Register Here
id: Daftar Di sini

# passwordChangeFullnameUsernameHint
source: Input your password for validation account
id: Masukkan kata sandi Anda untuk validasi akun

# passwordEmptyError
source: Please input your password for security purpose
id: Harap masukkan kata sandi Anda untuk tujuan keamanan

# changingFullnameUsernamePasswordDisclamer
source: For security purpose, please insert your account password, so that we can know this is you who trying to change the username
id: Demi keamanan, mohon masukkan password akun Anda, sehingga kami dapat mengetahui bahwa Andalah yang mencoba mengubah nama pengguna.

# changeFullnameUsernameFailedTitle
source: Change Fullname or Username failed
id: Gagal mengubah Nama Lengkap atau Nama Pengguna

# emptyFieldError
source: Please fill the required data
id: Silakan isi data yang dibutuhkan

# submitChange
source: Submit Changes
id: Kirim Perubahan

# greetingFriend
source: Welcome Back! {user}
id: Selamat Datang Kembali! {user}

# idleStatus
source: IDLE
id: BELUM DIMULAI

# progressStatus
source: PROGESS
id: PROGRESS

# doneStatus
source: DONE
id: SELESAI

# dataPriorityTitle
source: Data Priority
id: Data Prioritas

# lowPriority
source: LOW
id: RENDAH

# mediumPriority
source: MEDIUM
id: SEDANG

# highPriority
source: HIGH
id: TINGGI

# coreMenuTitle
source: Core Menu
id: Menu Utama

# dataClassTitle
source: Data Class
id: Data Kelas

# dataEventsTitle
source: Data Events
id: Data Acara

# dataLecturerTitle
source: Data Lecturer
id: Data Dosen

source: Recent Data Events
id: Data Acara Terbaru

source: Create Data Class
id: Buat Data Kelas

# editButton
source: Edit
id: Ubah

# deleteButton
source: Delete
id: Hapus

source: Search Item By Title
id: Cari Data Berdasarkan Nama

source: Filter Events
id: Filter Acara

# dateOfEventsLabel
source: Date Of Event
id: Tanggal Acara

# dateOfEventsHint
source: Please input Date Of Event
id: Silakan masukkan tanggal acara

# priorityLabel
source: Priority
id: Prioritas

# prioritySelect
source: Select Priority
id: Pilih Prioritas

# statusSelect
source: Select Status
id: Pilih Status

# clearButton
source: Clear
id: Bersihkan

# submitButton
source: Submit
id: Kirim

# deadlineLabel
source: Deadline
id: Tenggat Waktu

source: Create Data Lecturer
id: Buat Data Dosen

# detailEventTitle
source: Detail Event
id: Rincian Acara

# startHourLabel
source: Start Hour
id: Waktu Dimulainya

# endHourLabel
source: End Hour
id: Waktu Berakhirnya

# locationLabel
source: Location
id: Lokasi

# classNameLabel
source: Class Name
id: Nama Kelas

# descriptionLabel
source: Description
id: Deskripsi

source: Event History
id: Riwayat Acara

# inputDataClassTitle
source: Input Data Class
id: Data Input Kelas

# classNameHint
source: Input Class Name
id: Masukkan Nama Kelas

# classNameEmpty
source: Please input the name of the class
id: Silakan masukkan nama kelas

# lecturerLabel
source: Lecturer
id: Dosen

# lecturerSelect
source: Select Lecturer
id: Pilih Dosen

# dayLabel
source: Day
id: Hari

# daySelect
source: Select Day
id: Pilih Hari

# dayMonday
source: Monday
id: Senin

# dayTuesday
source: Tuesday
id: Selasa

# dayWednesday
source: Wednesday
id: Rabu

# dayThursday
source: Thursday
id: Kamis

# dayFriday
source: Friday
id: Jumat

# daySaturday
source: Saturday
id: Sabtu

# daySunday
source: Sunday
id: Minggu

# startHourEmpty
source: Please input starting time of the class
id: Silakan masukkan waktu dimulainya kelas

# endHourEmpty
source: Please input ending time of the class
id: Silakan masukkan waktu berakhirnya kelas

source: Create Data Class Failed
id: Buat Data Kelas Gagal

source: Create Data Class Success
id: Buat Data Kelas Berhasil

# inputDataLecturerTitle
source: Input Data Lecturer
id: Data Input Dosen

# lecturerNameLabel
source: Lecturer Name
id: Nama Dosen

# lecturerNameHint
source: Input Lecturer Name
id: Masukkan Nama Dosen

# lecturerNameEmpty
source: Please input the name of lecturer
id: Silakan masukkan nama dosen

# lecturerInputFailed
source: Create Data Lecturer Failed
id: Buat Data Dosen Gagal

# loginHistoryTitle
source: Login History
id: Riwayat Masuk

source: Create Event Schedule
id: Buat Jadwal Acara

# titleLabel
source: Title Event
id: Judul Acara

# titleHint
source: Input Title Event
id: Masukkan Judul Acara

# titleEmpty
source: Please input the title event
id: Silakan masukkan Judul Acara

# createEventSuccess
source: Successfully Create Event Schedule
id: Berhasil Membuat Jadwal Acara

source: Create Event Failed
id: Pembuatan Acara Gagal

# actionFeatureSuccess
source: {action} Success
id: {action} Berhasil

# actionFeatureFailed
source: {action} Failed
id: {action} Gagal

source: To
id: Sampai
